Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: རྒྱལ་པོ་དཔག་མེད་རྒྱལ་མཚན་གྱིས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དུ་བྱུང་བ་ཐོས་སོ། །ཐོས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ།
en: “Meanwhile, King Unfathomable Banner had heard that a thus-gone had appeared in the world, and so went to visit him.

source: ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་ཕྱག་འཚལ་ཏེ།
en: Once he arrived, he bowed at the Blessed One’s feet.

source: རིམ་གྲོ་དང་བདེ་བའི་གནས་ཐམས་ཅད་དུ་དགེ་སློང་གི་དགེ་འདུན་འཁོར་དང་བཅས་པ་དང་ཐབས་ཅིག་ཏུ་སྤྱན་དྲངས་ཤིང་།
en: He then invited the Blessed One together with his retinue, the community of monks, to have every type of service and happiness.

source: སྙིང་རྗེ་ཆེན་པོས་ཡོངས་སུ་ནོན་པའི་སེམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་ཕྱིར་ཡང་དག་པར་གནས་སོ། །
en: His mind overtaken by great compassion, he was fully committed to the cause of awakening.

source: མཽད་གལ་གྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔག་མེད་རྒྱལ་མཚན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time King Unfathomable Banner was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་དཔག་མེད་རྒྱལ་མཚན་དུ་གྱུར་ཏོ། །
en: In those days I was King Unfathomable Banner.”

source: མཽད་གལ་གྱི་བུ་ངས་ཁམས་དུ་མ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན། དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་ཏེ།
en: “Maudgalyāyana, in the past when I was training in the practices of a bodhisattva, I created countless roots of virtue for the sake of gaining knowledge of the several elements.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས། དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བྲམ་ཟེ་རྒྱལ་བ་འཛིན་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ།
en: Long ago in limitless cyclic existence, Maudgalyāyana, long before even the distant past there was a brahmin named Bearer of Victory, who was like a great sal tree.

source: མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་པ། གཞི་ཤེས་ཤིང་མཁས་ལ་དེ་ཤེས་རབ་ཀྱི་རང་བཞིན་ཅན་ཏེ། དེ་ཡང་སེམས་པར་གྱུར་ཏོ། །
en: He was wise, bright, prudent, knowledgeable, well informed, intelligent by nature, and introspective.

source: དེ་ཡོན་ཏན་དང་ཉེས་པ་སེམས་ཏེ་དབེན་པར་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ནས། སེམས་ཀྱིས་འདི་ལྟར་ཡོངས་སུ་རྟོག་པ་སྐྱེ་སྟེ།
en: Once, when thinking about good qualities and faults, he settled his mind in a disengaged state and began to wonder,

source: ཉེས་པའི་གཞི་ནི་གང་ལས་བྱུང་།
en: ‘Where did the basis of faults come from?

source: ཡོན་ཏན་གྱི་གཞི་ནི་གང་ལས་བྱུང་སྙམ་མོ། །
en: And where did the basis of good qualities come from?’

source: དེ་དེ་ལྟར་བསམ་ནས་བདག་ཉིད་ཀྱི་ཤེས་པ་གཞན་ལ་རག་མ་ལས་པ་བྱུང་ནས་ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་སྣ་ཚོགས་བྱུང་བ་དག་མ་བཟློག་པ་ལས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར།
en: Pondering that, without anyone else’s assistance, knowledge welled up from within himself, and he concluded, ‘We become afflicted because we do nothing to counteract the various afflictions happening in the present.

source: ད་ལྟར་བྱུང་བའི་ཉོན་མོངས་པ་བྱུང་བ་དག་བཟློག་ན་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར།
en: If we do counteract the afflictions happening in the present, we will not become afflicted.

source: ད་ལྟར་བྱུང་བའི་དགེ་བའི་ཆོས་བྱུང་བ་དག་བཟློག་ན་དཀར་པོའི་ཕྱོགས་མི་འཕེལ་ལ།
en: If we obstruct the wholesome qualities happening in the present, we will not foster goodness.

source: ད་ལྟར་བྱུང་བའི་དགེ་བའི་ཆོས་བྱུང་བ་དག་འཕེལ་ན་ཕྱོགས་དཀར་པོ་འཕེལ་བར་འགྱུར་རོ་སྙམ་མོ། །
en: If we foster the good qualities happening in the present, we will foster goodness.’

source: དེ་ནས་བྲམ་ཟེ་རྒྱལ་བ་འཛིན་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དགེ་བའི་ཆོས་དག་བྱུང་བ་དང་། མི་དགེ་བའི་ཆོས་དག་བཟློག་པ་སོ་སོར་ཇི་ལྟ་བ་བཞིན་དུ་བརྟགས་ནས་དགེ་བའི་ཆོས་བྱུང་བ་དག་ཡང་དག་པར་འཕེལ་བར་བྱེད་ཅིང་། མི་དགེ་བའི་ཆོས་བྱུང་བ་དག་འདོར་བར་བྱེད་དོ། །
en: “As the brahmin Bearer of Victory, who was like a great sal tree, then learned to discern with precision his wholesome qualities that were occurring from his unwholesome qualities to be counteracted, he was able to foster the wholesome qualities that were occurring and reject the unwholesome qualities that were occurring.

source: མི་དགེ་བའི་ཆོས་སྤངས་ཤིང་དགེ་བའི་ཆོས་རྣམས་ལ་བསྟེན་པས་ཏིང་ངེ་འཛིན་ཐོབ་སྟེ།
en: As he abandoned his unwholesome qualities and utilized the wholesome ones, he achieved absorption.

source: ཏིང་ངེ་འཛིན་གང་ཐོབ་པས་མི་དགེ་བའི་ཕྱོགས་ཐམས་ཅད་གཏན་དུ་ཟློག་པར་བྱེད་ལ། དགེ་བའི་ཆོས་འབྱུང་བ་རྣམས་མཆོག་ཏུ་འཕེལ་བར་བྱེད་དོ། །
en: He achieved such an absorption that he was able to permanently eliminate all unwholesomeness and develop wholesome qualities.

source: དེ་ལས་དེ་བྱས་ཤིང་བསགས་ལ་མཐར་ཕྱིན་ཅིང་རྫོགས་པ་དང་། ཡང་དག་པར་བླངས་པས་བསྐལ་པ་འབུམ་ཕྲག་བརྒྱད་ཅུར་ལོག་པར་ལྟུང་བར་མ་སོང་ངོ་། །
en: He continued to practice in that way through to completion, mastery, and total assimilation, such that for eight million eons he avoided falling into misfortune.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་རྒྱལ་བ་འཛིན་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ
en: “Maudgalyāyana, in case you may think that at that time the brahmin Bearer of Victory, who was like a great sal tree, was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་རྒྱལ་བ་འཛིན་ཅེས་བྱ་བ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུར་གྱུར་ཏོ། །
en: In those days I was the brahmin Bearer of Victory who was like a great sal tree.

source: ངས་འཁོར་བའི་རྒྱུ་བཟློག་པ་དང་། མྱ་ངན་ལས་འདས་པའི་རྒྱུ་ཡང་དག་པར་འཕེལ་བར་བྱ་བའི་ཕྱིར་བར་དེ་དག་ཏུ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དུ་མ་དག་ལ་བསྙེན་བཀུར་བྱས་ཤིང་ཡོངས་སུ་ཞུས་སོ། །
en: In order to counteract the causes of cyclic existence and foster the causes of nirvāṇa, in the interim period I served and asked questions to many quintillion buddhas.

source: དགེ་བའི་རྩ་བ་དེས་ང་ད་ལྟར་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་དང་བཅས་པའི་ཉོན་མོངས་པ་སྤངས་ནས་ཆོས་ལ་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་བརྙེས་སོ། །
en: Due to those roots of virtue, I have now abandoned the afflictions including the links of their habitual tendencies, and achieved wisdom that is unobscured in relation to phenomena.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then venerable Maudgalyāyana said to the Blessed One,

source: བཅོམ་ལྡན་འདས་ཐུགས་སྐྱོ་བ་མི་མངའ་བ་ནས། བཅོམ་ལྡན་འདས་ཡང་དག་པར་བླངས་པའི་གོ་ཆ་ཆེན་པོ་གསོལ་ནས་སེམས་ཅན་གྱི་དོན་དུ་བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པར་བྱང་ཆུབ་པ་ནི་ངོ་མཚར་ལགས་སོ། །
en: “Blessed One, it is amazing the way the Blessed One, without ever being discouraged, donned the great armor so well and became unsurpassedly and completely awakened for the sake of others.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One then replied to venerable Maudgalyāyana,

source: མཽད་གལ་གྱི་བུ་དེ་ལྟར་ཡིན་ཏེ། མཽད་གལ་གྱི་བུ་དེ་བཞིན་གཤེགས་པས་རྒྱུན་གྱི་རྗེས་སུ་འགྲོ་བའི་སེམས་ཅན་རྣམས་རྒྱུན་ལས་བཟློག་པར་བྱ་བའི་དོན་དུ་གོ་ཆ་ཆེན་པོ་འདི་བགོས་སོ། །
en: “Yes, Maudgalyāyana, the thus-gone ones don this great armor to bring sentient beings caught in the current to safety.

source: མཽད་གལ་གྱི་བུ་བདག་ཉིད་མ་བསྲུངས་པར་གཞན་གྱི་དོན་བྱ་བར་མི་ནུས་ཏེ།
en: Maudgalyāyana, if you do not protect yourself, you cannot help others.

source: ལུས་དང་སྲོག་ལ་མི་ལྟ་བས་ནི་གཞན་གྱི་དོན་བྱ་བར་ནུས་སོ།། །།
en: This way you can help others by paying no heed to risks to life and limb.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་གཙོ་བོ་ཆུ་ལྷ་ཞེས་བྱ་བ་གྲོང་དང་གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་ཞི་བའི་གཙོ་བོ་བྱེད་ཅིང་ཕྱུག་ལ་ནོར་མང་ཞིང་ལོངས་སྤྱོད་ཆེ་བ། ལོངས་སྤྱོད་མང་བ་བདག་གིར་བྱ་བ་མང་བ། རྫས་དང་ཡོ་བྱད་མང་ཞིང་འབྱོར་པ་ནོར་བུ་དང་མུ་ཏིག་དང་། བཻདཱུ་རྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་དང་། དངུལ་དང་གསེར་དུ་ལྡན་པ། མཛངས་ཤིང་གསལ་ལ་ཡིད་གཞུངས་ཤིང་སྙིང་རྗེ་ཡོད་པ། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པར་སེམས་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a man named Chief Water God, who was the chief of a region of peaceful villages, cities, and towns. He was rich, wealthy, prosperous, had many resources, many possessions, was endowed with numerous assets and goods, and owned jewels, pearls, beryl stones, conch shells, crystals, coral, silver, and gold. He was also wise, bright, prudent, and compassionate; he had the wish to help all sentient beings.

source: དེའི་ཚེ་གྲོང་རྡལ་གྲོང་ཁྱེར་ཞི་བར་རྒྱལ་པོ་གཉེན་ལྡན་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཞིག་ཀྱང་བྱུང་ངོ་། །
en: “At that time the king who ruled over these peaceful towns and cities was a spiritually-minded Dharma king named Bandhumat.

source: དེའི་མི་འཐུན་པ་རྒྱལ་པོ་དྲག་པའི་ལྷ་ཞེས་བྱ་བ་སྟོབས་ཆེ་ཞིང་དཔུང་ཆེ་ལ་སྟོབས་ཆེ་བས་རང་གི་རྒྱལ་སྲིད་ཀྱིས་ཆོག་མ་ཤེས་ནས་གཞན་གྱི་ཡུལ་འཁོར་ལ་གླགས་ལྟ་བར་བྱེད་དེ
en: He was rivaled by a powerful king named Severe God who commanded a large army and, unsatisfied with the extent of his kingdom, had his mind set on invading other territories.

source: དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་བཤམས་ནས། རྒྱལ་པོ་གཉེན་ལྡན་གྱི་ཡུལ་རྣམ་པར་རྒྱལ་བྱེད་དུ་འོང་ངོ་། །
en: Organizing the four divisions of his army, he advanced toward the territory of King Bandhumat to conquer it.

source: དེ་ནས་རྒྱལ་པོ་གཉེན་ལྡན་གྱིས་བློན་པོ་རྣམས་ལ་སྨྲས་པ།
en: “At that point King Bandhumat addressed his ministers, saying,

source: གྲོང་གི་གཙོ་བོ་དག་རྒྱལ་པོ་དྲག་པའི་ལྷ་སྟོབས་དང་། དཔུང་དང་དཔུང་ཆེན་པོས་རང་གི་རྒྱལ་སྲིད་ཀྱིས་ཆོག་མི་ཤེས་ནས་ངའི་རྒྱལ་སྲིད་འཕྲོག་ཏུ་འོང་སྟེ
en: ‘O village chiefs, this King Severe God, being unsatisfied with his own kingdom, is now advancing with his troops, forces, and armies to take over mine.

source: གྲོང་གི་གཙོ་བོ་དག་ཇི་ལྟར་བྱ་བ་དེ་སོམས་ཤིག །
en: Please think about what we can do, O village chiefs.’

source: དེ་ལ་ཁ་ཅིག་གིས་སྨྲས་པ།
en: “Some responded,

source: སྙིང་སྟོབས་བསྐྱེད་པར་བྱ་སྟེ།
en: ‘We need to muster courage!

source: སྙིང་སྟོབས་བསྐྱེད་དང་འོན་ཀྱང་སླར་ལྡོག་པར་འགྱུར་རོ། །
en: If we are brave they can be repelled!’

source: རྒྱལ་སྲིད་ཡོངས་སུ་བསྲུང་བའི་དོན་དུ་ནོར་དག་སྦྱིན་པར་བྱ་སྟེ།
en: ‘We should donate our wealth to protect the kingdom.

source: དེ་རྒྱལ་སྲིད་ཡོངས་སུ་བསྐྱངས་པ་དང་། ཡང་རྒྱལ་སྲིད་ཀྱི་དོན་ཡང་དག་པར་འཕེལ་ལོ། །
en: That way we can properly guard the kingdom and the kingdom can flourish!’

source: ནང་བློན་དང་བློན་པོ་དག་ལ་བསྒྲུབ་པར་བྱ་སྟེ།
en: ‘We should leave it to the ministers and cabinet ministers.

source: ནང་བློན་དག་གིས་རབ་ཏུ་སྦྱོར་བ་བྱའོ། །
en: The cabinet ministers should take charge!’

source: དཔུང་གི་ཚོགས་ཡང་དག་པར་བསྡུ་བར་བྱ་སྟེ། དམག་གིས་སླར་བརྒལ་བར་བྱའོ། །
en: ‘We should gather our forces and use military action to defend ourselves!’

source: དེ་ནས་རྒྱལ་པོ་གཉེན་ལྡན་གྱིས་གྲོང་ཁྱེར་གྱི་གཙོ་བོ་ཆུ་ལྷ་ལ་སྨྲས་པ།
en: “Finally, King Bandhumat approached the city chief Water God and said to him,

source: ཆུ་ལྷ་ཤེས་པར་གྱིས་ཤིག་གང་རྒྱལ་པོ་དྲག་པའི་ལྷ་རང་གི་རྒྱལ་སྲིད་ཀྱིས་ཆོག་མི་ཤེས་པ་འདི་ངའི་ཡུལ་རྣམ་པར་རྒྱལ་བྱེད་དུ་འོང་ན
en: ‘Water God, you must know—King Severe God is dissatisfied with his own kingdom and so is now coming to conquer my land.

source: དེ་ལ་འདིར་ཇི་ལྟར་བྱ།
en: What should be done?’

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། གྲོང་ཁྱེར་གྱི་གཙོ་བོ་ཆུ་ལྷས་རྒྱལ་པོ་གཉེན་ལྡན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: The city chief Water God then replied to King Bandhumat,

source: རྒྱལ་པོ་ཆེན་པོ་དེའི་སླད་དུ་གང་བདག་གིས་བགྱི་བ་དེ་བགྱི་སྟེ།
en: ‘Your Highness, whatever I am capable of, I will do.

source: ནོར་ཇི་སྙེད་འཚལ་བ་དེ་སྙེད་དུ་བདག་གིས་སྩལ་བར་བགྱིའོ། །
en: Whatever wealth I possess, I will donate.

source: དེ་སྔགས་ཀྱི་སྦྱོར་བ་དག་ལ་ཞུགས་ན། དེ་སྔགས་ཀྱི་སྟོབས་ཀྱིས་བཟློག་པར་མ་ནུས་ནས་དམག་འདྲེན་དུ་འོང་ངོ་། །
en: You may try to use magical spells, but spells will not be enough to stage a defense—the army will still advance.

source: དེ་ནས་དེའི་དོན་ཡང་དག་པར་བསྒྲུབ་པར་བྱ་བའི་ཕྱིར་ཕོ་ཉ་བཏང་ཞིང་གླང་པོ་དག་བྱིན་ཡང་འོན་ཀྱང་བཟློག་པར་མ་ནུས་ཏེ། དམག་དེ་ཉིད་མངོན་པར་འོང་ངོ་། །
en: So to succeed, you could send a messenger and offer an elephant. However, that also will not be enough to repel them—their army will still advance.’

source: དེ་ནས་རྒྱལ་པོ་གཉེན་ལྡན་གྱིས་དེའི་མི་འཐུན་པའི་རྒྱལ་པོ་ལ་ཕོ་ཉ་བཏང་སྟེ།
en: “King Bandhumat then dispatched a messenger to the rival king to say,

source: ཁྱོད་ལ་བདག་གིས་གསོལ་བ་ནི་བདག་ཀྱང་བདག་གི་རྒྱལ་སྲིད་འདིས་ཆོག །ཁྱོད་ཀྱང་རང་གི་རྒྱལ་སྲིད་ཀྱིས་ཆོག་པར་མཛོད་ལ། བདག་དང་ཁྱོད་དུ་ལྷན་ཅིག་དགའ་བར་མཛད་ཅིང་།
en: ‘I beg you: Let’s both just be satisfied with our own kingdoms—I with mine and you with yours.

source: ཁྱོད་ཀྱིས་སླར་བཟློག་པར་གསོལ་བར་འཚལ་ལོ། །
en: Let us form a truce—I implore you to retreat.’

source: དེས་འདི་ཡང་སྨྲས་སོ། །
en: Continuing, he said,

source: འཚོ་བ་ཡུན་ཐུང་ལ་ཕ་རོལ་ཏུ་འགྲོ་བར་འགྱུར་བས་ཁ་ཟས་གཅིག་ཙམ་གྱིས་འཚོ་བ་དང་། གོས་ཟུང་གཅིག་ཙམ་གྱིས་འཚོ་བ་དང་། མལ་ཆ་གཅིག་ཙམ་གྱིས་འཚོ་བ་དང་། ཆུང་མ་གཅིག་ཙམ་དང་ལྷན་ཅིག་དགའ་བར། གྲོགས་པོ་དེ་ལྟར་ཤེས་པར་གྱིས་ཤིག །
en: ‘Your livelihood will soon be passed on to others. My friend, you should therefore understand how to sustain yourself with just one meal, with just one set of clothes, and with just one bed, and to stay with just one wife.

source: མཁས་པ་ནི་ཕ་རོལ་དང་ལྷན་ཅིག་རྩོད་པར་མི་བྱེད་དེ་འཇིག་རྟེན་གྱི་ཁམས་དུ་མ་གསོ་བར་མི་ནུས་སོ། །
en: The wise do not get caught up in quarrels with others, for one is not able to sustain multiple world systems.

source: སེམས་ཅན་གཅིག་ལ་གང་གསེར་གྱི་རི་གཅིག་ཡོད་ཀྱང་དེས་ཆོག་མི་ཤེས་ཏེ། རྙེད་པ་ལ་ཆགས་པ་རབ་ཏུ་འཕེལ་བར་བྱེད་དོ། །
en: Someone may own a whole mountain of gold and yet still not be satisfied, but desire to gain even more.

source: གྲོགས་པོ་རེ་ཞིག་དགོངས་ལ་དེ་བཏང་བར་མཛོད་ཅིག །
en: Please reflect on this, my friend, and be generous.

source: མཁས་པས་ནི་ཆོག་ཤེས་པ་བསྐྱེད་པར་བྱའོ། །
en: Because wise people should learn contentment.

source: འདི་ལྟ་བུར་རྗེས་སུ་འཐུན་པར་བྱེད་པ་ན་ཆགས་པས་ཟིལ་གྱིས་ནོན་པ་མང་བས་མི་ལྡོག་སྟེ་འོང་ཞིང་འདི་སྐད་ཅེས་ཀྱང་སྨྲའོ། །
en: When acting in this agreeable manner, you will not be overtaken by those more overcome by desire.

source: བདག་བསད་ན་ནི་ཁྱོད་ཀྱི་རྒྱལ་སྲིད་དུ་འགྱུར་ལ། ཁྱོད་བསད་ན་ནི་བདག་གི་རྒྱལ་སྲིད་དུ་འགྱུར་ཅེས་དེའི་ཕོ་ཉ་སྒོ་ཞིང་སྤྲིང་ཡིག་ཀྱང་སྟོན་པར་བྱེད་དོ། །
en: If you kill me, the kingdom will be yours, though if I kill you, the kingdom will be mine.’ Such was the letter that he sent with the messenger.

source: འཇིག་རྟེན་གྱི་ཁམས་དུ་མ་ཞིག་གནས་ཏེ་ཁམས་གང་དང་གང་ཉིད་ལ་མངོན་པར་ཆགས་པའི་མངོན་པར་ཆགས་པ་དེ་ལས་སྡུག་བསྔལ་མྱོང་བར་འགྱུར།
en: ‘There are so many worldly elements, and it is due to our attachment to the elements that we experience suffering.

source: ཁམས་ཡོད་ན་སེམས་ཅན་གྱི་ཡོ་བྱད་དགོས་ལ་ཁམས་མེད་ན་སེམས་ཅན་གྱི་ཡོ་བྱད་མི་དགོས་ཏེ།
en: Whenever there is an element, there is a need for people’s material things; if there were no elements, there would be no need for people’s material things.

source: སྔོན་གྱི་ཁམས་བླངས་པ་ལས་ཡོ་བྱད་བཙལ་བ་ཡང་སྡུག་བསྔལ་མང་པོར་འགྱུར་རོ། །
en: Since taking on elements in the past, though we pursue material things, we just suffer more.

source: ཁམས་ཀྱིས་ཅིའི་ཕྱིར་སྡུག་བསྔལ་མྱོང་།
en: Why should we suffer due to the elements?

source: གལ་ཏེ་ཡང་བསྐྱེད་ན་ཡང་སྡུག་བསྔལ་མྱོང་བར་འགྱུར།
en: If I continue to create this, I will only continue to suffer.’

source: དེ་དེ་ལྟར་བསམས་ནས་རྒྱལ་སྲིད་བཏང་སྟེ། རབ་ཏུ་བྱུང་ནས་ཚངས་པའི་གནས་བཞི་བསྐྱེད་དེ་ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེས་སོ། །
en: Reflecting in this way, he gave up his kingdom and took ordination. Developing in the four abodes of Brahmā, he then took rebirth in the realm of Brahmā.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཉེན་ལྡན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་འཛིན་ན་དེ་ལྟར་མི་བལྟ་སྟེ།
en: Maudgalyāyana, in case you may think that at that time King Bandhumat was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་གཉེན་ལྡན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Bandhumat.

source: དེའི་ཚེ་ཡང་ང་ཁམས་དུ་མའི་ཉེས་པ་སྤངས་ཏེ།
en: At that time I gave up the defects of the several elements.

source: ད་ལྟར་ཡང་ཁམས་དུ་མའི་ཉེས་པ་མཐོང་བ་ལས་ཉེ་བར་ལེན་པ་རྣམ་པར་གྲོལ་ལོ། །
en: Since I still now perceive the faults of the several elements, I am free from appropriation.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་ཁམས་དུ་མའི་ཉེས་པ་མཐོང་བ་ལས་ཆགས་པ་དང་བྲལ་བར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattvas should come to see the faults of the manifold elements and go beyond attachment.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་ཚངས་པའི་ལྷ་ཞེས་བྱ་བ་མཛངས་ཤིང་ཆོས་སེམས་པ་ཞིག་བྱུང་ངོ་། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Brahmadeva who was both wise and spiritually inclined.

source: བདག་ཅི་སྟེ་མི་འདི་དག་གི་དབང་ཕྱུག་ལ་དབང་བྱེད།
en: ‘What is this self that governs as the lord of humans?

source: མི་དེ་དག་གི་མིང་ནི་གང་ཞིག་དབང་ཕྱུག་གང་དག་ལ་བདག་དབང་བྱེད་སྙམ་མོ། །
en: By which human name does the self govern as the lord?’

source: ཁམས་བཅྭ་བརྒྱད་པོ་འདི་དག་སྟེ།
en: ‘It must be the eighteen elements.

source: ཁམས་བཅྭ་བརྒྱད་གང་ལ་མི་འདི་དག་འདི་སྙམ་དུ་ཀུན་འབྱུང་བ་ནི་གང་། གཞི་ནི་གང་ཡིན་སྙམ་དུ་འདུ་ཤེས་སྐྱེས་སོ། །
en: What is the origin and basis of these eighteen elements of human beings?’

source: འདི་དག་ནི་ལས་ཀྱིས་མངོན་པར་བསྒྲུབས་པ་ཡིན་ལ། ལས་ཀྱང་རྣམ་པ་གསུམ་སྟེ། ཆགས་པ་ལས་སྐྱེས་པ་དང་ཞེ་སྡང་ལས་སྐྱེས་པ་དང་། གཏི་མུག་ལས་སྐྱེས་པའོ། །
en: ‘They are created by karma, which is itself of three types: the type born out of desire, the type born out of anger, and the type born out of ignorance.

source: ཆགས་པ་ལས་སྐྱེས་པའི་ལས་ཀྱིས་འགྲོ་བ་ལྔའི་ཁམས་སེམས་ཅན་དམྱལ་བ་དང་དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་མི་དང་ལྷ་རྣམས་སུ་མངོན་པར་འགྲུབ་བོ། །
en: Karma born out of desire leads to the formation of the realms of five classes of beings: the hells, the animal realm, the realm of the Lord of Death, the human world, and the god realm.

source: ཞེ་སྡང་ལས་སྐྱེས་པའི་ལས་ཀྱིས་འགྲོ་བ་གསུམ་གྱི་ཁམས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་ཡང་དག་པར་འགྲུབ་བོ། །
en: Karma born out of anger leads to the formation of the realms of three classes of beings: the hells, the animal realm, and the realm of the Lord of Death.

source: གཏི་མུག་ལས་སྐྱེས་པའི་ལས་ཀྱིས་འགྲོ་བ་ལྔའི་ཁམས་སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། མི་དང་ལྷ་རྣམས་སུ་མངོན་པར་འགྲུབ་བོ། །
en: Karma born out of ignorance also leads to the formation of the realms of five classes of beings: the hells, the animal realm, the realm of the Lord of Death, the human realm, and the god realm.

source: ཆགས་པ་ནི་སྒོ་ལྔ་དག་གི་ལས་བྱེད། ཞེ་སྡང་གི་སྒོ་གསུམ། གཏི་མུག་ནི་སྒོ་ལྔ་དག་གི་ལས་བྱེད་དོ། །
en: Desire functions via five senses, while anger functions via three, and ignorance functions via five.

source: ཆགས་པའི་ས་གང་ཡིན་པ་གཏི་མུག་གི་ཡང་དེ་བཞིན་ནོ། །
en: Any locus of our desire is likewise a locus of ignorance.

source: ཞེ་སྡང་ནི་ངན་སོང་འབའ་ཞིག་གིས་སྟེ།
en: Anger is only a locus of the lower realms.

source: དེས་ན་ཁམས་དུ་མ་ཞེས་བྱའོ། །
en: Thus, they are referred to as “the several elements.”

source: སྣང་བ་བྱིན་པས་ནི་ངའི་མིག་བསྒྲུབས།
en: “ ‘Presented with visible forms, my eyes are formed.

source: ཁྲོ་བ་མེད་པས་ནི་ངའི་གཟུགས་ཀྱི་ཁམས་བསྒྲུབས།
en: Without any anger, my form element is created.

source: ཤེས་པ་རྗེས་སུ་བྱིན་པས་ནི་ངའི་མིག་གི་རྣམ་པར་ཤེས་པའི་ཁམས་བསྒྲུབས་སོ། །
en: Presented with consciousness, my visual consciousness is formed.

source: དགའ་བའི་ཚིག་བྱིན་པས་ནི་ངའི་རྣ་བའི་ཁམས་བསྒྲུབས།
en: Presented with pleasant words, my ear element is formed.

source: རོལ་མོའི་སྒྲ་བྱིན་པས་ནི་ངའི་སྒྲའི་ཁམས་བསྒྲུབས།
en: Presented with the sounds of music, my sound element is formed.

source: རོལ་མོའི་སྒྲ་ལ་རྗེས་སུ་ཡི་རང་བར་བྱས་པས་ནི་ངའི་རྣ་བའི་རྣམ་པར་ཤེས་པའི་ཁམས་བསྒྲུབས་སོ། །
en: Taking joy in the sound of music, my ear consciousness element is formed.

source: སྤོས་བྱིན་པས་ནི་ངའི་སྣའི་ཁམས་བསྒྲུབས།
en: Presented with scents, my olfactory element is formed.

source: སྤོས་ཞིམ་པོ་བྱིན་པས་ནི་ངའི་དྲིའི་ཁམས་བསྒྲུབས།
en: Presented with pleasant scents, my scent element is formed.

source: སྤོས་སྦྱར་བ་བྱིན་པས་ནི་ངའི་སྣའི་རྣམ་པར་ཤེས་པའི་ཁམས་བསྒྲུབས་སོ། །
en: Presented with a mixture of scents, my olfactory consciousness is formed.

source: རོ་ཞིམ་པོ་བྱིན་པས་ནི་ངའི་ལྕེའི་ཁམས་བསྒྲུབས།
en: Presented with delicious tastes, my tongue element is formed.

source: རོའི་མཆོག་བྱིན་པས་ནི་ངའི་རོའི་ཁམས་བསྒྲུབས།
en: Presented with superior tastes, my taste element is formed.

source: རོ་སྦྱར་བ་བྱིན་པས་ནི་ངའི་ལྕེའི་རྣམ་པར་ཤེས་པའི་ཁམས་བསྒྲུབས་སོ། །
en: Presented with a mixture of tastes, my taste consciousness is formed.

source: ཡིད་བསྡམས་པས་ནི་ངའི་ལུས་ཀྱི་ཁམས་བསྒྲུབས།
en: As the mind is constrained, my body element is formed.

source: གོས་འཇམ་པོ་བྱིན་པས་ནི་ངའི་རེག་བྱའི་ཁམས་བསྒྲུབས།
en: Presented with soft clothing, my texture element is formed.

source: གོས་བྱིན་པ་ལ་རྗེས་སུ་ཡི་རང་བས་ནི་ངའི་ལུས་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་བསྒྲུབས་སོ། །
en: Due to delight in that clothing, my tactile consciousness is formed.

source: ཡིད་དུ་འོང་བ་བྱིན་པས་ནི་ངའི་ཡིད་ཀྱི་ཁམས་བསྒྲུབས།
en: Presented with something pleasant, my mind element is formed.

source: ཆོས་བྱིན་པས་ནི་ངའི་ཆོས་ཀྱི་ཁམས་བསྒྲུབས།
en: Presented with mental objects, my mental object element is formed.

source: ཆོས་བསམ་པ་ལ་བཟོད་པས་ནི་ངའི་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པའི་ཁམས་བསྒྲུབས་ཏེ།
en: Through the endurance of cognition of mental objects, my mental consciousness element is formed.

source: རྒྱུ་འདི་དག་དང་། རྐྱེན་འདི་དག་དང་རྒྱུ་གང་དག་དང་། རྐྱེན་གང་དག་གིས་ཁམས་བཅྭ་བརྒྱད་མངོན་པར་འགྲུབ་བོ། །
en: These are the causes and conditions for the eighteen elements to be formed.’

source: དེ་འདི་ལྟར་ཡང་སེམས་ཏེ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་བསྐྱེད་དེ
en: “Pondering in this way, he arrived at a correct perspective.

source: དེ་དགེ་བའི་རྩ་བ་དེས་སྐྱེ་བ་ཐམས་ཅད་ཀྱི་སྐྱེ་གནས་ལ་ཉོན་མོངས་པའི་རྐྱེན་གྱིས་ལས། ལས་ཀྱི་རྐྱེན་གྱིས་ཁམས་ཐེ་ཚོམ་མེད་པ་རྗེས་སུ་འཐོབ་བོ། །
en: Due to those roots of virtue, he achieved certainty beyond doubt that in every mode of rebirth, afflictions lead to karma, and karma leads to the elements.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཚངས་པའི་ལྷ་ཞེས་བྱ་བ་དེ་གཞན་ཡིན་པར་ཐེ་ཚོམ་འམ། ཡིད་གཉིས་སུ་བྱེད་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: Maudgalyāyana, in case you may have any doubts or hesitations so as to think that at that time King Brahmadeva was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ཚངས་པའི་ལྷ་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was King Brahmadeva.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ལས་དང་ཉོན་མོངས་པ་ལ་མཁས་པར་བྱ་ཞིང་རྣམ་པར་སྨིན་པ་ལ་ཡང་མཁས་པར་བྱའོ། །
en: Therefore, Maudgalyāyana, bodhisattva great beings should be knowledgeable regarding karma and afflictions, not to mention knowledgeable regarding the ways they ripen.

source: མཽད་གལ་གྱི་བུ་ངས་ཁམས་དུ་མ་ཤེས་པ་ཀུན་འབྱུང་བ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུ་བྱས་ཤིང་
en: “Maudgalyāyana, I created limitless roots of virtue in the past when I was training in the practices of a bodhisattva in order to gain knowledge of the origin as related to knowledge of the several elements.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འདི་ཉིད་ཡོངས་སུ་ཚོལ་བ་ན་ང་ཚངས་པར་སྤྱོད་པ་ཡང་དག་པར་བླངས་པས་བུད་མེད་རྒྱན་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པ་འབུམ་དག་རབ་ཏུ་བྱིན་ཏེ
en: In pursuit of unexcelled and perfect awakening, I also observed chastity and thus gave up hundreds of thousands of beautifully adorned women.

source: བདག་གི་འདོད་པའི་དོན་དུ་མ་ཡིན་གྱི། འོན་ཀྱང་སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་འདོད་པས་བུད་མེད་རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱ་སྟོང་དག་ཡོངས་སུ་བཏང་ངོ་། །
en: This was not for some personal benefit—rather, wanting to fulfill the wishes of sentient beings, I gave up trillions of perfectly adorned women.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་ཕུར་བུའི་ལྷ་ཞེས་བྱ་བ་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའི་རྫུ་འཕྲུལ་དང་ལྡན་པ་རྒྱལ་སྲིད་ཀྱི་སྤྱི་བྱེད་པ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Bṛhaspatideva. He had magical powers as a result of karmic ripening and served as overseer of the kingdom.

source: ཆོས་ཀྱིས་ཕྱིར་རྒོལ་བ་ནི་བཅོམ། ཀླ་ཀློ་དེ་དག་དང་ནི་བྲལ།
en: In that capacity, heretics were subdued and the land was free of barbarians.
